public class Question {
	public static String Que;
	public static int ANS;
	public static String[] C = new String[4];
	
	Question(){
	}
	
	public static void question(int RandomQuestion){
		
		switch(RandomQuestion){
		
		case 0:
			Que = "兒歌[妹妹背著洋娃娃走到【那裡】來看花]?";
			C[0] = "花圃 ";
			C[1] = "公園 ";
			C[2] = "花園 ";
			C[3] = "操場 ";
			ANS = 2;
			break;
			
		case 1:
			Que = "下列何者為觸控技術";
			C[0] = "油壓式觸控";
			C[1] = "電阻式觸控";
			C[2] = "自由式觸控";
			C[3] = "指壓式觸控";
			ANS = 1;
			break;
			
		case 2:
			Que = "知名畫作【拾】是哪位畫家所畫?";
			C[0] = "達芬奇";
			C[1] = "康丁斯基";
			C[2] = "蒙克";
			C[3] = "米勒";
			ANS = 3;
			break;
			
		case 3:
		Que = "福德正神[土地公]的妻子土地婆，相傳每月何時回家?";
			C[0] = "出嫁后就不增回娘家了";
			C[1] = "初一 十五";
			C[2] = "初二 十六";
			C[3] = "每日回娘家";
			ANS = 3;
			break;
			
		case 4:
			Que = "新聞中常提到的兩岸【九二共識】是什麼?";
			C[0] = "一個中國 ";
			C[1] = "一個太平洋";
			C[2] = "笑而不答";
			C[3] = "一個上海";
			ANS = 0;
			break;
			
		case 5:
			Que = "八仙過海的八仙之中，誰最風流 ?";
			C[0] = "呂洞賓";
			C[1] = "韓湘子";
			C[2] = "漢鐘離";
			C[3] = "李鐵拐";
			ANS = 0;
			break;
			
		case 6:
			Que = "【天平座】屬於水風火土那個象限?";
			C[0] = "土";
			C[1] = "風";
			C[2] = "水";
			C[3] = "火";
			ANS = 1;
			break;
		case 7:
			Que= "下列何者並非樂團五月天的歌曲?";
			C[0] = "戀愛ing";
			C[1] = "小情歌";
			C[2] = "知足";
			C[3] = "入陣曲";
			ANS = 1;
			break;
		case 8:
			Que = "平面坐標當中左下方是那個象限?";
			C[0] = "第二象限";
			C[1] = "第一象限";
			C[2] = "第四象限";
			C[3] = "第三象限";
			ANS = 3;
			break;
		
		case 9:
			Que = "美國文學名著【湯姆歷險記】的作者是?";
			C[0] = "歐亨利";
			C[1] = "馬克吐溫";
			C[2] = "莫泊桑";
			C[3] = "史蒂芬金";
			ANS = 1;
			break;
		case 10:
			Que = "台灣於西元幾年首次政黨輪替?";
			C[0] = "1996 ";
			C[1] = "2004 ";
			C[2] = "2000 ";
			C[3] = "2008 ";
			ANS = 3;
			break;
			
		case 11:
			Que = "下列何者為身體最大的器官";
			C[0] = "骨骼";
			C[1] = "血管";
			C[2] = "皮膚";
			C[3] = "心臟";
			ANS = 3;
			break;
			
		case 12:
			Que = "阿基米德宣稱【給我一個支點，我就可以撐起全世界】是用什麼科學原理?";
			C[0] = "牛頓第二運動定律";
			C[1] = "連通管原理";
			C[2] = "浮力";
			C[3] = "槓桿原理";
			ANS = 3;
			break;
			
		case 13:
			Que = "台灣最新成立的國家公園?";
			C[0] = "台江";
			C[1] = "金門";
			C[2] = "澎湖南方四島";
			C[3] = "東沙環礁";
			ANS = 2;
			break;
			
		case 14:
			Que = "台北捷運2013年年底開通的新路線為?";
			C[0] = "淡水線 ";
			C[1] = "瀘州線";
			C[2] = "板南線";
			C[3] = "信義線";
			ANS = 3;
			break;
			
		case 15:
			Que = "下列何者為台灣國產的手機廠牌?";
			C[0] = "Samsung";
			C[1] = "Sony";
			C[2] = "Apple";
			C[3] = "HTC";
			ANS = 3;
			break;
			
		case 16:
			Que = "下列哪個城市位於南半球?";
			C[0] = "開羅";
			C[1] = "新加坡";
			C[2] = "曼谷";
			C[3] = "雪梨";
			ANS = 3;
			break;
			
		case 17:
			Que = "86 + 88 =?";
			C[0] = "229";
			C[1] = "295";
			C[2] = "201";
			C[3] = "174";
			ANS = 3;
			break;
			
		case 18:
			Que = "於2009年去世的美國【流行音樂之王】為..?";
			C[0] = "李聖傑";
			C[1] = "周杰倫";
			C[2] = "麥克.傑克遜";
			C[3] = "鳳飛飛";
			ANS = 2;
			break;
		
		case 19:
			Que = "小說【神雕俠女】中，主角楊過最後身上有何殘疾?";
			C[0] = "斷右臂";
			C[1] = "斷左臂";
			C[2] = "斷手指";
			C[3] = "瞎左眼";
			ANS = 0;
			break;	
		case 20:
			Que = "請問甲午戰是西元幾年?";
			C[0] = "2000";
			C[1] = "1998";
			C[2] = "1894 ";
			C[3] = "1999 ";
			ANS = 2;
			break;
			
		case 21:
			Que = "林懷明創辦了什麼?";
			C[0] = "十方樂集";
			C[1] = "雲門舞集";
			C[2] = "四海遊龍";
			C[3] = "八方雲集";
			ANS = 1;
			break;
			
		case 22:
			Que = "在中國，自古以來就有天府之國美譽的地區是?";
			C[0] = "海南島";
			C[1] = "上海";
			C[2] = "北京";
			C[3] = "四川盆地";
			ANS = 3;
			break;
			
		case 23:
			Que = "下列哪一位女主播沒當過藝人?";
			C[0] = "方念華";
			C[1] = "侯佩琴";
			C[2] = "吳怡霈";
			C[3] = "王怡仁";
			ANS = 0;
			break;
			
		case 24:
			Que = "下列哪個物品不宜放入大同電鍋加熱?";
			C[0] = "塑膠容器 ";
			C[1] = "瓷碗";
			C[2] = "鐵製便當盒";
			C[3] = "鐵鍋";
			ANS = 0;
			break;
			
		case 25:
			Que = "2015現任的新竹市長是?";
			C[0] = "林志炫";
			C[1] = "林智勝";
			C[2] = "林志穎";
			C[3] = "林智堅";
			ANS = 2;
			break;
			
		case 26:
			Que = "請問鹿指的是鹿的哪個部位?";
			C[0] = "鹿尾巴上的毛";
			C[1] = "鹿角";
			C[2] = "鹿腳指甲";
			C[3] = "鹿耳朵裡的毛";
			ANS = 1;
			break;
		case 27:
			Que = "日文中用哪種花卉代表女同性戀GL?";
			C[0] = "水仙";
			C[1] = "薔薇";
			C[2] = "牡丹";
			C[3] = "百合";
			ANS = 3;
			break;
		case 28:
			Que = "【我的字典里沒有放棄，因為已鎖定你】是哪一歌詞?";
			C[0] = "念你";
			C[1] = "愛你";
			C[2] = "愛情字典";
			C[3] = "永不放棄";
			ANS = 0;
			break;
		
		case 29:
			Que = "下列何者是大型犬?";
			C[0] = "米格魯";
			C[1] = "大麥町";
			C[2] = "米格機";
			C[3] = "雪納瑞";
			ANS = 1;
			break;	
		case 30:
			Que = "一下何者非托福考試內容?";
			C[0] = "讀";
			C[1] = "說";
			C[2] = "聽";
			C[3] = "畫";
			ANS = 3;
			break;
			
		case 31:
			Que = "2015台灣最大的賄賂案，是哪一所監獄?";
			C[0] = "綠島監獄";
			C[1] = "新竹監獄";
			C[2] = "台北監獄";
			C[3] = "台中監獄";
			ANS = 2;
			break;
			
		case 32:
			Que = "【人生自古誰無死】的下一句是?";
			C[0] = "少小離家老大回";
			C[1] = "鄉音無改鬢毛催";
			C[2] = "別抱琵笆半遮面";
			C[3] = "留取丹心照汗青";
			ANS = 3;
			break;
			
		case 33:
			Que = "一般常見的電貝斯有幾條弦?";
			C[0] = "2條";
			C[1] = "4條";
			C[2] = "6條";
			C[3] = "8條";
			ANS = 1;
			break;
			
		case 34:
			Que = "環境保護當中所謂的【三生】不包括下列何者?";
			C[0] = "生產 ";
			C[1] = "生物";
			C[2] = "生態";
			C[3] = "生活";
			ANS = 1;
			break;
			
		case 35:
			Que = "【三國演義】中周旋呂布跟董卓之間的女人是?";
			C[0] = "楊貴妃";
			C[1] = "貂蟬";
			C[2] = "西斯";
			C[3] = "林黛玉";
			ANS = 1;
			break;
			
		case 36:
			Que = "台灣本島中，不存在下列何種地形?";
			C[0] = "平原";
			C[1] = "高原";
			C[2] = "盆地";
			C[3] = "山地";
			ANS = 1;
			break;
		case 37:
			Que = "法國哪個媒體被槍擊造成12人死亡？";
			C[0] = "<<理查月刊>>";
			C[1] = "<<理查周刊>>";
			C[2] = "<<查理月刊>>";
			C[3] = "<<查理周刊>>";
			ANS = 3;
			break;
		case 38:
			Que = "61 + 44 = ?";
			C[0] = "108";
			C[1] = "115";
			C[2] = "105";
			C[3] = "120";
			ANS = 2;
			break;
		
		case 39:
			Que = "一般所吃的紅蘿蔔是其哪一部位?";
			C[0] = "根";
			C[1] = "葉";
			C[2] = "樹枝";
			C[3] = "果實";
			ANS = 0;
			break;
		case 40:
			Que = "哪個老牌電視臺因去年虧損2.6億?";
			C[0] = "中視";
			C[1] = "台視";
			C[2] = "華視";
			C[3] = "中天";
			ANS = 0;
			break;
		case 41:
			Que = "下列哪一個[地名+人民]最先出現，是這種用法的始祖?";
			C[0] = "楊梅艷芳";
			C[1] = "風山下智久";
			C[2] = "三重劉德華";
			C[3] = "池上戶彩";
			ANS = 2;
			break;
			
		case 42:
			Que = "哪一個國家在2015年還沒有通過【同性婚姻】法案?";
			C[0] = "台灣";
			C[1] = "美國";
			C[2] = "英國";
			C[3] = "馬來西亞";
			ANS = 0;
			break;
			
		case 43:
			Que = "名著【傲慢與偏見】書中男主角是?";
			C[0] = "達西先生";
			C[1] = "梅西先生";
			C[2] = "西提先生";
			C[3] = "達陣先生";
			ANS = 1;
			break;
			
		case 44:
			Que = "下列哪個不是指【朋友】?";
			C[0] = "日文-有達";
			C[1] = "中文-勝達";
			C[2] = "英文-friend";
			C[3] = "韓文-親舊";
			ANS = 1;
			break;
			
		case 45:
			Que = "范瑋琪的丈夫是下列何者?";
			C[0] = "趙又廷";
			C[1] = "陳建州";
			C[2] = "阮經天";
			C[3] = "藍正龍";
			ANS = 1;
			break;
			
		case 46:
			Que = "中國知名建築萬里長城的【天下第一關】是?";
			C[0] = "嘉峪關";
			C[1] = "陽關";
			C[2] = "大境門";
			C[3] = "山海關";
			ANS = 3;
			break;
		case 47:
			Que = "斯巴達最著名的為下列何者？";
			C[0] = "浪漫主義";
			C[1] = "代議政治";
			C[2] = "民主主義";
			C[3] = "軍國主義";
			ANS = 3;
			break;
		case 48:
			Que = "96 + 85 = ?";
			C[0] = "181";
			C[1] = "132";
			C[2] = "131";
			C[3] = "137";
			ANS = 0;
			break;
		
		case 49:
			Que = "【冰桶挑戰】的募款活動是為了什麼疾病發起?";
			C[0] = "BGK肝硬化";
			C[1] = "AIDS愛滋病";
			C[2] = "ALS肌萎縮性脊髓側索硬化";
			C[3] = "CAT感冒";
			ANS = 0;
			break;		
		}				
	}	
}
